In [6]:
import pandas as pd
import numpy as np

In [7]:
sozluk1 = {"İsim":["Ahmet","Mehmet","Mert"],
          "Spor":["Tenis","Badminton","Koşu"],
          "Kalori":[150,200,300]}
sozluk1

{'İsim': ['Ahmet', 'Mehmet', 'Mert'],
 'Spor': ['Tenis', 'Badminton', 'Koşu'],
 'Kalori': [150, 200, 300]}

In [8]:
sozluk2 = {"İsim":["Can","Canan","Semih"],
          "Spor":["Yüzme","Badminton","Koşu"],
          "Kalori":[100,250,400]}
sozluk2

{'İsim': ['Can', 'Canan', 'Semih'],
 'Spor': ['Yüzme', 'Badminton', 'Koşu'],
 'Kalori': [100, 250, 400]}

In [9]:
sozluk3 = {"İsim":["Şehmus","Rıza","Mesut"],
          "Spor":["Tenis","Basketbol","Futbol"],
          "Kalori":[250,450,500]}
sozluk3

{'İsim': ['Şehmus', 'Rıza', 'Mesut'],
 'Spor': ['Tenis', 'Basketbol', 'Futbol'],
 'Kalori': [250, 450, 500]}

In [11]:
df1 = pd.DataFrame(sozluk1,index=[1,2,3])
df1

     İsim       Spor  Kalori
1   Ahmet      Tenis     150
2  Mehmet  Badminton     200
3    Mert       Koşu     300

In [12]:
df2 = pd.DataFrame(sozluk2,index=[4,5,6])
df2

    İsim       Spor  Kalori
4    Can      Yüzme     100
5  Canan  Badminton     250
6  Semih       Koşu     400

In [13]:
df3 = pd.DataFrame(sozluk3,index=[7,8,9])
df3

     İsim       Spor  Kalori
7  Şehmus      Tenis     250
8    Rıza  Basketbol     450
9   Mesut     Futbol     500

In [16]:
pd.concat([df1,df2,df3],axis = 0)

     İsim       Spor  Kalori
1   Ahmet      Tenis     150
2  Mehmet  Badminton     200
3    Mert       Koşu     300
4     Can      Yüzme     100
5   Canan  Badminton     250
6   Semih       Koşu     400
7  Şehmus      Tenis     250
8    Rıza  Basketbol     450
9   Mesut     Futbol     500

In [17]:
pd.concat([df1,df2,df3],axis = 1)

,İsim,Spor,Kalori,İsim,Spor,Kalori,İsim,Spor,Kalori
1,Ahmet,Tenis,150.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Mehmet,Badminton,200.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Mert,Koşu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Can,Yüzme,100.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Canan,Badminton,250.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Semih,Koşu,400.0,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,Şehmus,Tenis,250.0
8,NaN,NaN,NaN,NaN,NaN,NaN,Rıza,Basketbol,450.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mesut,Futbol,500.0

## merge - kaynaştırma

In [19]:
sozluk1 = {"İsim":["Ahmet","Mehmet","Mert"],
          "Kalori":[150,200,300]}
sozluk1

{'İsim': ['Ahmet', 'Mehmet', 'Mert'], 'Kalori': [150, 200, 300]}

In [20]:
sozluk2 = {"İsim":["Ahmet","Mehmet","Mert"],
          "Spor":["Tenis","Badminton","Koşu"]}
sozluk2

{'İsim': ['Ahmet', 'Mehmet', 'Mert'], 'Spor': ['Tenis', 'Badminton', 'Koşu']}

In [22]:
df1 = pd.DataFrame(sozluk1,index = [1,2,3])
df1

     İsim  Kalori
1   Ahmet     150
2  Mehmet     200
3    Mert     300

In [25]:
df2 = pd.DataFrame(sozluk2,index = [4,5,6])
df2

     İsim       Spor
4   Ahmet      Tenis
5  Mehmet  Badminton
6    Mert       Koşu

In [27]:
pd.merge(df2,df1,on="İsim")

     İsim       Spor  Kalori
0   Ahmet      Tenis     150
1  Mehmet  Badminton     200
2    Mert       Koşu     300

In [28]:
# high level

In [29]:
maaslar = {"Isim":["Ali","Baran","Can","Mehmet","Ali"],
          "Departman":["Yazılım","Hukuk","IK","Hukuk","IK"],
          "Maas":[10000,15000,20000,18000,25000]}
maaslar

{'Isim': ['Ali', 'Baran', 'Can', 'Mehmet', 'Ali'],
 'Departman': ['Yazılım', 'Hukuk', 'IK', 'Hukuk', 'IK'],
 'Maas': [10000, 15000, 20000, 18000, 25000]}

In [31]:
maasDf = pd.DataFrame(maaslar)
maasDf

     Isim Departman   Maas
0     Ali   Yazılım  10000
1   Baran     Hukuk  15000
2     Can        IK  20000
3  Mehmet     Hukuk  18000
4     Ali        IK  25000

In [32]:
maasDf["Departman"].unique()

array(['Yazılım', 'Hukuk', 'IK'], dtype=object)

In [33]:
maasDf["Departman"].nunique()

3

In [35]:
maasDf["Departman"].value_counts()

Hukuk      2
IK         2
Yazılım    1
Name: Departman, dtype: int64

In [41]:
def bruttenNete(maas):
    return maas * 0.66

In [42]:
maasDf["Maas"].apply(bruttenNete)

0     6600.0
1     9900.0
2    13200.0
3    11880.0
4    16500.0
Name: Maas, dtype: float64

In [43]:
maasDf.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False
4  False      False  False

In [44]:
newGroup = {"Sınıf":["Simpson","Simpson","Simpson","SouthPark","SouthPark"],
           "Isim":["Bart","Homer","Bart","Kenny","Cartman"],
           "Puan":[10,20,30,40,50]}

In [45]:
newDf = pd.DataFrame(newGroup)

In [46]:
newDf

       Sınıf     Isim  Puan
0    Simpson     Bart    10
1    Simpson    Homer    20
2    Simpson     Bart    30
3  SouthPark    Kenny    40
4  SouthPark  Cartman    50

In [50]:
newDf.pivot_table(values=["Puan"],index=["Sınıf","Isim"])

                   Puan
Sınıf     Isim
Simpson   Bart       20
          Homer      20
SouthPark Cartman    50
          Kenny      40

In [51]:
newDf.pivot_table(values=["Puan"],index=["Sınıf","Isim"],aggfunc=np.sum)

                   Puan
Sınıf     Isim
Simpson   Bart       40
          Homer      20
SouthPark Cartman    50
          Kenny      40